# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  #n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  #s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, PKIModule_2, [256]]  #3
  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, PKIModule_2, [512]]  #6
  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, PKIModule_2, [512]]  #9
  - [-1, 1, Conv, [1024, 3, 2]] # 10-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 12
  - [-1, 2, C2PSA, [1024]] # 13
  - [-1, 1, PKIModule_2, [1024]]  #14

# YOLO11n head
head:
  # p4与p5、p3融合
  - [-1, 1, Upsample, [512]]
  - [6, 1, Conv, [512, 3, 2]]
  - [[-1, 9, -2], 1, DASI, []]
  - [-1, 2, C3k2, [512, False]]
  - [-1, 1, Inception_EMA, [512]] # 19
  
    # p3与p4、p2融合
  - [-1, 1, Upsample, [512]]
  - [3, 1, Conv, [512, 3, 2]]
  - [[-1, 6, -2], 1, DASI, []]
  - [-1, 2, C3k2, [256,False]]
  - [-1, 1, Inception_EMA, [256]] # 24
  
    # p2与p3融合
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, []] 
  - [-1, 2, C3k2, [128,False]]
  - [-1, 1, Inception_EMA, [128]] # 28

    # p2与跳跃连接融合
  - [[-1, 3], 1, Concat, []] 
  - [-1, 2, C3k2, [128, False]] 
  - [-1, 1, Inception_EMA, [128]] # 31

    # p3与p2、跳跃连接融合
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 24, 6], 1, Concat, []] 
  - [-1, 2, C3k2, [256, False]] 
  - [-1, 1, Inception_EMA, [256]] # 35
  
   # p4与p3、跳跃连接融合
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 19, 9], 1, Concat, []] 
  - [-1, 2, C3k2, [512, False]] 
  - [-1, 1, Inception_EMA, [512]] # 39
  
  # p5与p4融合
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 14], 1, Concat, []] 
  - [-1, 2, C3k2, [1024, True]] 
  - [-1, 1, Inception_EMA, [1024]] # 43
  
  
  - [[31, 35, 39, 43], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)
